app/controllers/articles_controller.rb

  def create
    # binding.pry
    @article = Article.new
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2019-04-27 02:03:25.214445"], ["updated_at", "2019-04-27 02:03:25.214445"]]

  def update
    # binding.pry
     #look for the query in the database
     @article = Article.find(params[:id])
     @article.update(title: params[:article][:title], description: params[:article][:description])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-04-27 18:23:42.845687"], ["id", 1]]